from django.db import migrations

class Migration(migrations.Migration):

    dependencies = [
        ('core', '0002_exchangeprogram'),
    ]

    operations = [
        migrations.RunSQL(
            sql="""
                INSERT INTO core_exchangeprogram (university, languages, slots, deadline, description) VALUES
                ('Uniwersytet Warszawski, Польща', 'польська, англійська', '5', '2026-11-15', 'Один із найстаріших польських університетів, що пропонує широкий спектр програм обміну для студентів-інформатиків.'),
                ('KU Leuven (Бельгія)', 'English', '2 місця', '2026-12-01', 'Провідний дослідницький університет Бельгії з високими академічними стандартами та англомовними курсами.'),
                ('Vilnius University, Литва', 'англійська', 'до 4', '2026-10-20', 'Найбільший вищий навчальний заклад Литви, розташований у старовинному місті з багатими традиціями.'),
                ('Uniwersytet Jagielloński, Польща', 'Польська, Англійська', '3', '2026-11-15', 'Престижний європейський університет у Кракові з чудовими можливостями для міжнародного стажування.'),
                ('University of Tartu - Естонія', 'англійська, естонська', '2', '2027-01-10', 'Провідний центр цифрових інновацій та академічної науки в Естонії.'),
                ('Masaryk University, Чехія', 'англійська', '1 місце', '2026-09-30', 'Сучасний університет у Брно з комфортним кампусом та розвиненою IT-інфраструктурою.');
            """,
            reverse_sql="DELETE FROM core_exchangeprogram;"
        ),
    ]